一面

微前端描述下
怎么协同开发
注意事项
2：场景问题
2.1：两个请求并行发送，如果其中一个请求出错，就用默认值代替，怎么实现
2.2：页面有两个相同的请求怎么复用
3：react 生命周期
4：react通信
5：跨域通信有哪些
6：http缓存
7：懒加载
8：commonjs 和 es module区别
9：tree sharking原理
10: loader 会 plugins区别
11：防抖和节流区别，大概实现
12: 了解哪些新技术
二面

介绍一下项目亮点
介绍一下微前端
说一下npm包管理机制
A插件依赖D插件版本是1.0.1，B插件依赖D插件版本是1.0.2，C插件依赖D插件1.1.0，那么npm i 之后，下载了几个版本的D插件
HTTP常见的状态码 ，401 403分别是什么， 常见的请求头响应头有哪些
说一下webpack配置，常用的loader、plugin
场景题目
if(a == 1) {
    console.log(a);
}

// 控制台会报错么
// 如果报错是什么类型的错误
三面

我面的三面基本没有技术面
介绍项目
你充当的角色
你平时是如何学习的
对自己的规划
别人怎么评价你的