/**
 * 题目：给定一个正整数，返回它在 Excel 表中相对应的列名称。例如，   
 * 1 -> A    
 * 2 -> B
 * 3 -> C
 * ...
 * 26 -> Z
 *     
 * 27 -> AA
 * 28 -> AB 
 * 29 -> AC
 * 30 -> AD
 **/



/**
 * 题目：树层序遍历
 * 输出[[A], [B, E], [C, D, F, G]]
 *          A
 *        / \
 *        B   E
 *       / \ / \
 *      C   DF  G
 * 输出[[A], [B, E], [C, D, F, G]]        
 **/



/**
 * 题目：将数组 [[3, 2], [1, 1],[2,1],[1,2],[2,2],[3,1]] 排序为 [[1,2],[1,1],[2,2],[2,1],[3,2],[3,1]]
 **/
const _arr = [
    [3, 2],
    [1, 1],
    [2, 1],
    [1, 2],
    [2, 2],
    [3, 1]
];

function sortArr(arr, order = true) {
    arr.sort((a, b) => order ? a[0] < b[0] : a[0] > b[0]);
    return arr;
}
console.log('_arr:', sortArr(_arr))